In [2]:
# Downloading Titanic Dataset

!kaggle competitions download -c titanic

Downloading titanic.zip to E:\UNH\Sem2\ML\Week_3

  0%|          | 0.00/34.1k [00:00<?, ?B/s]
100%|##########| 34.1k/34.1k [00:00<00:00, 952kB/s]

In [5]:
# Creating DataFrame for test and train
import pandas as pd
import numpy as np

test_df = pd.read_csv('test.csv')
train_df = pd.read_csv('train.csv')

In [6]:
train_df.tail(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [8]:
train_df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [11]:
que = train_df.drop('Survived', axis = 1)
ans = train_df[['Survived']]

In [21]:
train_df.drop(columns=['Ticket', 'Cabin', 'Name', 'Embarked'], inplace=True)
test_df.drop(columns=['Ticket', 'Cabin', 'Name', 'Embarked'], inplace=True)

In [22]:
for column in train_df.columns:
    if train_df[column].dtype == type(object):
        le = sklearn.preprocessing.LabelEncoder()
        train_df[column] = le.fit_transform(train_df[column])

In [24]:
train_df.tail()

     PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch   Fare
886          887         0       2    1  27.0      0      0  13.00
887          888         1       1    0  19.0      0      0  30.00
888          889         0       3    0   NaN      1      2  23.45
889          890         1       1    1  26.0      0      0  30.00
890          891         0       3    1  32.0      0      0   7.75

In [25]:
test_df.tail()

     PassengerId  Pclass     Sex   Age  SibSp  Parch      Fare
413         1305       3    male   NaN      0      0    8.0500
414         1306       1  female  39.0      0      0  108.9000
415         1307       3    male  38.5      0      0    7.2500
416         1308       3    male   NaN      0      0    8.0500
417         1309       3    male   NaN      1      1   22.3583

In [26]:
test_df['Sex'] = le.fit_transform(test_df['Sex'])

In [27]:
test_df.tail()

     PassengerId  Pclass  Sex   Age  SibSp  Parch      Fare
413         1305       3    1   NaN      0      0    8.0500
414         1306       1    0  39.0      0      0  108.9000
415         1307       3    1  38.5      0      0    7.2500
416         1308       3    1   NaN      0      0    8.0500
417         1309       3    1   NaN      1      1   22.3583

In [28]:
que = train_df.drop(columns=['Survived'])
ans = train_df['Survived']

In [32]:
que.fillna(0, inplace=True)
ans.fillna(0, inplace=True)

In [33]:
que.tail()

     PassengerId  Pclass  Sex   Age  SibSp  Parch   Fare
886          887       2    1  27.0      0      0  13.00
887          888       1    0  19.0      0      0  30.00
888          889       3    0   0.0      1      2  23.45
889          890       1    1  26.0      0      0  30.00
890          891       3    1  32.0      0      0   7.75

In [34]:
ans.tail()

886    0
887    1
888    0
889    1
890    0
Name: Survived, dtype: int64

In [45]:
import sklearn
from sklearn.neighbors import KNeighborsClassifier

knn = KNeighborsClassifier(n_neighbors = 3)

knn.fit(que, ans)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=3, p=2,
                     weights='uniform')

In [37]:
test_df.tail()

     PassengerId  Pclass  Sex   Age  SibSp  Parch      Fare
413         1305       3    1   NaN      0      0    8.0500
414         1306       1    0  39.0      0      0  108.9000
415         1307       3    1  38.5      0      0    7.2500
416         1308       3    1   NaN      0      0    8.0500
417         1309       3    1   NaN      1      1   22.3583

In [38]:
test_df.fillna(0, inplace=True)

In [46]:
knn.predict(test_df)

array([0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0,
       1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0,
       1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1,
       0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0,
       0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1,
       1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0,
       1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0,
       1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0,
       1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1,
       1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0,
       0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0],
      dtype=int64)

In [47]:
# Printing Accuracy

print('Accuracy is',(knn.score(que, ans))*100)

Accuracy is 78.00224466891133